import re

ranks = {'PV2': '이병', 'PFC': '일병', 'CPL': '상병', 'SGT': '병장'}
senior = {'송재현', '홍준형', '허재강', '고종우'}

months = {2408, 2409, 2410, 2411, 2501, 2502, 2503, 2504, 2505, 2506, 2507, 2508, 2509, 2510, 2511}
roster = {2408: {'김영훈', '안민균', '윤여진'},
          2409: {'도현우', '박신우', '구민상', '배자운', '이현기'},
          2410: {'곽민준', '손우용', '이준상', '김정원', '이재준'},
          2411: {'홍준형', '손승범', '허재강', '이헌'},
          2501: {'김하진', '임채헌', '최민서', '김현우', '이종명', '송재현'},
          2502: {'김두영', '김명식', '박성우', '김성우', '고종우', '김정범', '조원익', '우남규', '백승원'},
          2503: {'한민우', '이주안', '박천조', '서지혁', '임홍범'},
          2504: {'김경범', '염지웅'},
          2505: {'박중현', '장지호', '김동현', '김상윤', '이경주'},
          2506: {'이성규', '이진우', '이다니엘창민', '김하준'},
          2507: {'김제석', '장지원', '안예준', '이후윤', '장도영', '김지원', '이권기'},
          2508: {'김형진', '박성준', '소진', '양희경', '박정빈'},
          2509: {'김시우', '위현', '이도겸', '오재영', '이지원'},
          2510: {'이셩훈', '강호성', '노명서'},
          2511: {'김성환', '윤종웅', '이정준', '임준섭', '강두연', '김준영', '서인휘', '신경환', '환지환'}}


def extract(text):
  pattern = r"^(\w+).*?\(([^)]+)\)"
  match = re.search(pattern, text, re.IGNORECASE)
  
  name = match.group(2).strip()
  rank = match.group(1)
  order = ''
  for i in months:
    if name in roster[i]:
      order = i
  
  if name in senior:
    return '선임병장', order, name
  
  if match:
    return ranks[rank], order, name